import React from "react";
// import Header from "../../components/header/Header";
import videoBG from "../assets/bg.mp4";
import "./Banner.css";
import Paragrapb from "../../../../components/paragraph/Paragrapb";
import Heading from "../../../../components/heading/Heading";
// import "./HomePage.css";
const Banner = () => {
  return (
    <div className="banner">
      <video src={videoBG} autoPlay loop muted />
      <div className="content_home">
        <div className="left_content">
          <Heading name="Công Nghệ Nâng Tầm Sức Khỏe" />
          <div className="text_content">
            <Paragrapb
              text="Chào mừng đến với Pharmatech, nơi tiến trình chăm sóc sức khỏe
              được thực hiện nâng cấp, nơi thói quen bảo vệ bản thân được hòa
              mình vào Blockchain, công nghệ tân tiến nhất mọi thời đại."
            />
          </div>
          <div className="contract_content">
            <button>Contract</button>
            <div className="sub_contract">
              <p>0xa7002fccc....34f2a9</p>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="14"
                height="15"
                viewBox="0 0 14 15"
                fill="none"
              >
                <path
                  d="M5.18981 0.593217L5.18987 0.593163C5.24946 0.532019 5.32756 0.500047 5.40625 0.5C5.40629 0.5 5.40632 0.5 5.40636 0.5H8.65625C9.16596 0.5 9.65744 0.707556 10.0218 1.08128C10.3866 1.45544 10.5938 1.96554 10.5938 2.5V10C10.5938 10.5345 10.3866 11.0446 10.0218 11.4187C9.65744 11.7924 9.16596 12 8.65625 12H2.96875C2.45904 12 1.96756 11.7924 1.60318 11.4187C1.23837 11.0446 1.03125 10.5345 1.03125 10V5.0001C1.03125 5.00007 1.03125 5.00003 1.03125 5C1.0313 4.90761 1.06722 4.8215 1.12726 4.75994L1.12731 4.75988L5.18981 0.593217ZM6.21875 1.16667H5.71875V1.66667V5C5.71875 5.09243 5.68283 5.17861 5.62277 5.24021C5.56314 5.30137 5.48499 5.33333 5.40625 5.33333H2.15625H1.65625V5.83333V10C1.65625 10.3496 1.79154 10.6873 2.03623 10.9383C2.28134 11.1897 2.61651 11.3333 2.96875 11.3333H8.65625C9.00849 11.3333 9.34366 11.1897 9.58877 10.9383C9.83346 10.6873 9.96875 10.3496 9.96875 10V2.5C9.96875 2.1504 9.83346 1.81266 9.58877 1.56169C9.34366 1.3103 9.00849 1.16667 8.65625 1.16667H6.21875ZM2.94712 3.81762L2.1193 4.66667H3.30512H4.59375H5.09375V4.16667V2.845V1.61595L4.23575 2.49595L2.94712 3.81762ZM12.7188 2.16667C12.7975 2.16667 12.8756 2.19863 12.9353 2.25979C12.9953 2.32139 13.0312 2.40757 13.0312 2.5V12.5C13.0312 13.0345 12.8241 13.5446 12.4593 13.9187C12.0949 14.2924 11.6035 14.5 11.0938 14.5H2.96875C2.89001 14.5 2.81186 14.468 2.75223 14.4069C2.69217 14.3453 2.65625 14.2591 2.65625 14.1667C2.65625 14.0742 2.69217 13.9881 2.75223 13.9265C2.81186 13.8653 2.89001 13.8333 2.96875 13.8333H11.0938C11.446 13.8333 11.7812 13.6897 12.0263 13.4383C12.271 13.1873 12.4062 12.8496 12.4062 12.5V2.5C12.4062 2.40757 12.4422 2.32139 12.5022 2.25979C12.5619 2.19863 12.64 2.16667 12.7188 2.16667Z"
                  fill="#16EDB1"
                  stroke="#16EDB1"
                />
              </svg>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};
export default Banner;
